logs/istio-defaults/dataplane-probe-deployment.log
{"level":"info","ts":1694007984.8023696,"logger":"fallback","caller":"injection/injection.go:63","msg":"Starting informers..."}
2023/09/06 13:46:25 Starting dataplane probe for target: deployment
Requests      [total, rate, throughput]         180000, 1000.01, 999.44
Duration      [total, attack, wait]             3m0s, 3m0s, 101.133ms
Latencies     [min, mean, 50, 90, 95, 99, max]  100.269ms, 101.175ms, 101.104ms, 101.749ms, 101.844ms, 101.972ms, 135.2ms
Bytes In      [total, mean]                     4299863, 23.89
Bytes Out     [total, mean]                     0, 0.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:180000  
Error Set:
2023/09/06 13:49:25 SLA 1 passed. P95 latency is in 100000000-105000000ms time range
2023/09/06 13:49:25 Dataplane probe test finished
2023/09/06 13:49:25 Shutting down InfluxReporter