logs/istio-defaults/load-test-always.log
{"level":"info","ts":1694073958.3847442,"logger":"fallback","caller":"injection/injection.go:63","msg":"Starting informers..."}
2023/09/07 08:05:58 Starting the load test.
2023/09/07 08:07:04 All pods are done (scaled to zero) or terminating after 1m2.000132227s
Requests      [total, rate, throughput]         719999, 2000.00, 1999.43
Duration      [total, attack, wait]             6m0s, 6m0s, 103.143ms
Latencies     [min, mean, 50, 90, 95, 99, max]  101.438ms, 111.854ms, 103.055ms, 103.887ms, 104.788ms, 123.846ms, 3.749s
Bytes In      [total, mean]                     17199596, 23.89
Bytes Out     [total, mean]                     0, 0.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:719999  
Error Set:
2023/09/07 08:13:04 SLA 1 passed. P95 latency is in 100-115ms time range
2023/09/07 08:13:04 SLA 2 passed. Max latency is below 10s
2023/09/07 08:13:04 SLA 3 passed. No errors occurred
2023/09/07 08:13:04 Load test finished
2023/09/07 08:13:04 Shutting down InfluxReporter